# hw 3 normal Лукьянов Максим
# Задача-2:
# Напишите функцию, сортирующую принимаемый список по возрастанию.
# Для сортировки используйте любой алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort()


def sort_to_max(origin_list):
    n = 1
    while n < len(origin_list):
        for i in range (len(origin_list)-n):
            if origin_list[i]>origin_list[i+1]:
                origin_list[i], origin_list[i+1] = origin_list[i+1], origin_list[i]
        n += 1
    print(origin_list)
    pass

sort_to_max([2, 10, -12, 2.5, 20, -11, 4, 4, 0])